/****************************************

 数据类型（Types）：Primitive Types/Reference Types

 1. 整型
 int:    4字节     取值范围刚过20亿
 short:  2字节     -32768 - 32767
 long:   8字节     -9223372036854775808 - 9223372036854775807
 byte:   1字节     -128 - 127
 * 长整型数值有L或l的后缀
 * 十六进制数值有0x或0X前缀
 * 八进制有0前缀

 2. 浮点型
 float   4字节     取值范围约±3.40282347E + 38F
 double  8字节     取值范围有效位数约15位
 * 浮点数值计算须遵循IEEE 754规范。
 * 正无穷大、负无穷大/NaN（不是一个数字）用以表示溢出和出错情况。

 3. char型
 char型表示单个字符，如今有变化，有些Unicode字符可以用一个char值描述，另外一些Unicode字符需要两个char值。
 * char型字面量值需用单引号括起来
 * char型值可以用十六进制表示，范围从u0000到、uFFFF

 3. 布尔型
 布尔型（boolean）只有两个值true与false，用来逻辑判断。
 * 整形与boolean型之间不能相互转换
 **********************************************/
